# Bottom Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rectangle..::..Bottom Property
Rectangle Class See Also
---
The y-coordinate of the bottom-right corner of the rectangle.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int Bottom { get; set; }
```

Visual Basic
---
```text
Public Property Bottom As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Bottom {
	int get ();
	void set (int value);
}
```

# See Also
Rectangle Class
Autodesk.Revit.DB Namespace